<a href="https://colab.research.google.com/github/nurimammasri/Wooky-Pandas/blob/master/06.%20Filtering%20and%20Transformation%20DataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Filtering DataFrame with Boolean**

Dapat dibilang kalau filtering dataframe dengan boolean is more human. karena kita mengakses suatu data berdasarkan logika dan dapat kita masukan ke dalam suatu statement, sebagai contoh, ‘Ambilkan data yang memiliki nilai luas lebih dari 50’. ketika mengubahnya kedalam suatu kode python ckup dengan menuliskan df>50. maka akan menghasillkan suatu data Boolean Series berisi Ya (True) dan Tidak (False).

Filtering DataFrame dimulai dari pertanyaan.

Pada tulisan ini saya akan memberikan beberapa contoh mengakses DataFrame dengan Filtering by Boolean. Kita akan menggunakan suatu data tentang kejadian titanic. pertama kita import data kita.

In [1]:
# from google.colab import drive
# drive.mount('/content/drive/')

## **Mengidentifikasi Data titanic.csv**

In [2]:
# '/content/drive/My Drive/Colab Notebooks/Wooky Pandas/titanic.csv'
# import pandas as pd
# df = pd.read_csv('https://drive.google.com/uc?id=1PG9O6PjvMDgDtUrExwFYLqR_T_rf3Vpz')
# df.head()

In [3]:
# '/content/drive/My Drive/Colab Notebooks/Wooky Pandas/titanic.csv'
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Data/titanic.csv')
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

Dari gambar dapat kita lihat bahwa data kita memiliki beberapa column seperti tentang status survived, tentang umur, tentang jenis kelamain, dan lain-lain. misalkan boss kita menyuruh kita untuk melakukan beberapa hal sebagai berikut :

1. Tunjukan kepada saya semua data orang-orang yang selamat!!
2. Tunjukan kepada saya semua data laki-laki yang selamat.
3. Tunjukan kepada saya semua data tentang perempuan yang tidak selamat di umur lebih dari 40 tahun atau kurang dari 20 tahun.

Hal pertama yang mesti kita lakukan untuk melakukan operasi yang bisa menjawab permintaan di atas adalah… kita membuat terlebih dahulu suatu Boolean Series. kemudian boolean series tersebut kita masukan kedalam dataframe kita. langsung saja akan saya perlihatkan dengan contoh. dimulai dari pertanyaan pertama.

### 1. Data Orang Selamat

In [4]:
# boolean series orang orang yang selamat
survived = df.Survived == 1
print(survived)

0      False
1       True
2       True
3       True
4      False
       ...
151     True
152    False
153    False
154    False
155    False
Name: Survived, Length: 156, dtype: bool

In [5]:
df[survived].head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[5 rows x 12 columns]

### 2. Data laki-laki yang selamat
Seperti biasa kita buat terlebih dahulu boolean series nya, kali ini kita membuat 2 boolean series. yaitu boolean series orang yang selamat dan bolean series orang yang berjenis kelamin laki-laki. berikut caranya

In [6]:
# bolean series orang yang selamat
survived = df.Survived == 1
# boolean series laki-laki
laki2 = df.Sex == 'male'

# tampilkan data boolean series laki2
print(laki2)

0       True
1      False
2      False
3      False
4       True
       ...
151    False
152     True
153     True
154     True
155     True
Name: Sex, Length: 156, dtype: bool

Sekarang kita masukan 2 boolean series ini ke dalam dataframe kita, ada sedikit hal yang perlu kamu lakukan ketika ingin memfilter dataframe dengan lebih dari satu kondisi boolean series, 

**pertama** kamu harus memberikan kurung kepada setiap boolean series mu, 

**kedua** hubungkan kedua boolean series itu dengan logical operator seperti `& (and), | (or)`, dan lain sebagainya. berikut caranya.

In [7]:
print(df[(survived) & (laki2)])

     PassengerId  Survived  Pclass  ...     Fare    Cabin  Embarked
17            18         1       2  ...  13.0000      NaN         S
21            22         1       2  ...  13.0000      D56         S
23            24         1       1  ...  35.5000       A6         S
36            37         1       3  ...   7.2292      NaN         C
55            56         1       1  ...  35.5000      C52         S
65            66         1       3  ...  15.2458      NaN         C
74            75         1       3  ...  56.4958      NaN         S
78            79         1       2  ...  29.0000      NaN         S
81            82         1       3  ...   9.5000      NaN         S
97            98         1       1  ...  63.3583  D10 D12         C
107          108         1       3  ...   7.7750      NaN         S
125          126         1       3  ...  11.2417      NaN         C
127          128         1       3  ...   7.1417      NaN         S
146          147         1       3  ...   7.7958      NaN         S

[14 rows x 12 columns]

### 3. Data Perempuan yang tidak selamat dengan umur lebih dari 40 tahun atau kurang dari 20 tahun.
Coba perhatikan ada berapa boolean series yang perlu kita buat. disini ada 4 boolean series yang perlu kita buat, yaitu orang yang tidak selamat, orang yang berjnis kelamin perempuan, orang yang berumur lebih dari 40 tahun, dan orang yang kurang dari 20 tahun. jadi mari kita buat boolean series nya.

In [8]:
# orang yang tidak selamat
not_survived = df.Survived == 0

# orang berjnis kelamin perempuan
perempuan = df.Sex == 'female'

# orang yang berumur lebih dari 40 tahun
lebih_40 = df.Age > 40

# orang yang berumur kurang dari 20 tahun
kurang_20 = df.Age < 20

df[(not_survived) & (perempuan) & (lebih_40 | kurang_20)]

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
14            15         0       3  ...   7.8542   NaN         S
24            25         0       3  ...  21.0750   NaN         S
38            39         0       3  ...  18.0000   NaN         S
49            50         0       3  ...  17.8000   NaN         S
71            72         0       3  ...  46.9000   NaN         S
111          112         0       3  ...  14.4542   NaN         C
114          115         0       3  ...  14.4583   NaN         C
119          120         0       3  ...  31.2750   NaN         S
132          133         0       3  ...  14.5000   NaN         S
147          148         0       3  ...  34.3750   NaN         S

[10 rows x 12 columns]

## **Mengidentifikasi contoh 2**

In [9]:
matematika = pd.Series({'otong':80, 'dinda':90, 'mamat':100})
fisika = pd.Series({'otong':90, 'dinda':70, 'mamat':100})
biologi = pd.Series({'otong':100, 'dinda':60, 'mamat':90})

df = pd.DataFrame({'matematika':matematika, 'fisika':fisika, 'biologi':biologi})
df

       matematika  fisika  biologi
otong          80      90      100
dinda          90      70       60
mamat         100     100       90

### Filtering data Frame and objek bolean series

*   Ujian Matenatika di atas 80

In [10]:
matematika_80_atas = df['matematika'] > 80
matematika_80_atas

otong    False
dinda     True
mamat     True
Name: matematika, dtype: bool

In [11]:
df[matematika_80_atas]

       matematika  fisika  biologi
dinda          90      70       60
mamat         100     100       90

### Combine multiple Filtering DataFrame
*   Ujian Fisika dan matematika di atas 80

In [12]:
matematika_80_atas = df['matematika'] > 80
fisika_80_atas = df['fisika'] > 80
fisika_80_atas

otong     True
dinda    False
mamat     True
Name: fisika, dtype: bool

In [13]:
df[fisika_80_atas]

       matematika  fisika  biologi
otong          80      90      100
mamat         100     100       90

In [14]:
df[(matematika_80_atas) | (fisika_80_atas)]

       matematika  fisika  biologi
otong          80      90      100
dinda          90      70       60
mamat         100     100       90

In [15]:
df[(matematika_80_atas) & (fisika_80_atas)]

       matematika  fisika  biologi
mamat         100     100       90

### Filtering not Null value di dalam DataFrame

In [16]:
matematika = pd.Series({'otong':80, 'dinda':90, 'mamat':None, 'eca':90})
fisika = pd.Series({'otong':None, 'dinda':70, 'mamat':100, 'eca':70})
biologi = pd.Series({'otong':100, 'dinda':60, 'mamat':90, 'eca':None})

df = pd.DataFrame({'matematika':matematika, 'fisika':fisika, 'biologi':biologi})
df

       matematika  fisika  biologi
otong        80.0     NaN    100.0
dinda        90.0    70.0     60.0
mamat         NaN   100.0     90.0
eca          90.0    70.0      NaN

In [17]:
matematika_notnull = df['matematika'].notnull()
matematika_notnull

otong     True
dinda     True
mamat    False
eca       True
Name: matematika, dtype: bool

In [18]:
df[matematika_notnull]

       matematika  fisika  biologi
otong        80.0     NaN    100.0
dinda        90.0    70.0     60.0
eca          90.0    70.0      NaN

In [19]:
matematika_null = df['matematika'].isnull()
matematika_null

otong    False
dinda    False
mamat     True
eca      False
Name: matematika, dtype: bool

In [20]:
df[matematika_null]

       matematika  fisika  biologi
mamat         NaN   100.0     90.0

## Mengidentifikasi  Contoh 3

In [21]:
import pandas as pd
dataseries1 = pd.Series([423967, 695862, 141297, 170312, 149995], index=['California', 'Texas', 'New York', 'Florida', 'Illinois'])
dataseries2 = pd.Series([38332521, 26448193, 19651127, 19552860, 12882135], index=['California', 'Texas', 'New York', 'Florida', 'Illinois'])
data = pd.DataFrame({'area 123':dataseries1, 'pop':dataseries2})
data

            area 123       pop
California    423967  38332521
Texas         695862  26448193
New York      141297  19651127
Florida       170312  19552860
Illinois      149995  12882135

In [22]:
pop_20jt_lbh = data['pop'] > 20000000

In [23]:
data[pop_20jt_lbh]

            area 123       pop
California    423967  38332521
Texas         695862  26448193

# **Data Transformation**
Data transformasi adalah mengubah format data kepada suatu format yang kita inginkan. didalam matematika dikenal dengan istilah mapping. dalam melakukan transformasi kita memerlukan terlebih dahulu suatu fungsi yang dapat memetkan bentuk data awal kita menjadi bentuk data akhir yang kita inginkan.

![filtering_transformation_dataframes01.png](https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Images/filtering_transformation_dataframes01.png)

![filtering_transformation_dataframes02.png](https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Images/filtering_transformation_dataframes02.png)

Pandas menyediakan berbagai method bawaan untuk melakukan transformasi terhadap data kita, beberapa diantaranya telah diperkenalkan pada hari pertama di minggu ke dua ini. misalnya describe(), method describe ini tidak lain memetakan data mentah kita menjadi suatu data hasil tentang deskriptif statistik.

Selain itu masih banyak lagi method2 bawaan yang di sediakan pandas untuk melakukan dat transformasi seperti method mean(), dan lain sebagaiinya.

Kita juga bisa melakukan transformasi sesuai keinginan kita sendiri atau custom transformation. untuk melakukan custom transformation terlebih dahulu perlu membuat fungsi untuk melakukan mapping antara data awal hingga menjadi data yang di harapkan. berikut akan di periihatkan satu contoh transformasi data

kita kembali akan menggunakan data tentang titanic. misalkan kita ingin mengubah data kita, dimana kita ingin mengubah column age, semua nilainya di kurangi dengan nilai minimum dari kolumn tersebut. maka pertama kita definiskan fungsi tersebut.

In [24]:
def minus_minimum(x):
    return x - x.min()

setelah kita mendefinisikan fungsinya. sekarang kita akan menggunakan method apply() dari pandas. method apply ini akan menerima suatu fungsi kemudian ‘meng-apply’ fungsi tersebut ke dalam setiap sumbu dari dataframe, secara default sumbu yang ‘apply’ adalah sumbu column. langsung saja kita perlihatkan. sebelum nykita lihat dulu data awal kita seperti apa.

In [25]:
# '/content/drive/My Drive/Colab Notebooks/Wooky Pandas/titanic.csv'
# import pandas as pd
# df = pd.read_csv('https://drive.google.com/uc?id=1PG9O6PjvMDgDtUrExwFYLqR_T_rf3Vpz')
# df.head()
# print(df[['Age']].apply(minus_minimum))

In [26]:
# '/content/drive/My Drive/Colab Notebooks/Wooky Pandas/titanic.csv'
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Data/titanic.csv')
df.head()
print(df[['Age']].apply(minus_minimum))

       Age
0    21.17
1    37.17
2    25.17
3    34.17
4    34.17
..     ...
151  21.17
152  54.67
153  39.67
154    NaN
155  50.17

[156 rows x 1 columns]

In [27]:
matematika = pd.Series({'otong':80, 'dinda':90, 'mamat':100})
fisika = pd.Series({'otong':90, 'dinda':70, 'mamat':100})
biologi = pd.Series({'otong':100, 'dinda':60, 'mamat':90})

df = pd.DataFrame({'matematika':matematika, 'fisika':fisika, 'biologi':biologi})
df

       matematika  fisika  biologi
otong          80      90      100
dinda          90      70       60
mamat         100     100       90

## Build in Method for Transformation

In [28]:
df.floordiv(10)

       matematika  fisika  biologi
otong           8       9       10
dinda           9       7        6
mamat          10      10        9

## Custom Function Transformation